frontend/models/User.php

SELECT * FROM `user` WHERE (`ID`=1) AND (`STATUS`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['ID' => $id, 'STATUS' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`USERNAME`='test@test.ru') AND (`STATUS`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['USERNAME' => $username, 'STATUS' => self::STATUS_ACTIVE]);